app/controllers/application_controller.rb

  def home
  	@projects = Project.all
    @posts = Post.order('created_at DESC').limit(4).all
---
SELECT "projects".* FROM "projects"
SELECT "posts".* FROM "posts" ORDER BY posts.created_at DESC, created_at DESC LIMIT 4